OpenNuvoton/M251BSP/SampleCode/StdDriver/USBD_Audio_Headset/descriptors.c
    (AUDIO_RATE_24K & 0xFF),
    ((AUDIO_RATE_24K >> 8) & 0xFF),
    ((AUDIO_RATE_24K >> 16) & 0xFF),

    (AUDIO_RATE_32K & 0xFF),
    ((AUDIO_RATE_32K >> 8) & 0xFF),
    ((AUDIO_RATE_32K >> 16) & 0xFF),

    (AUDIO_RATE_48K & 0xFF),
    ((AUDIO_RATE_48K >> 8) & 0xFF),
    ((AUDIO_RATE_48K >> 16) & 0xFF),

    (AUDIO_RATE_96K & 0xFF),
    ((AUDIO_RATE_96K >> 8) & 0xFF),
    ((AUDIO_RATE_96K >> 16) & 0xFF),

    /* Endpoint Descriptor (ISO OUT Audio Data Endpoint - alternate 1) */
    0x09,                             /* bLength */
    0x05,                             /* bDescriptorType */
    ISO_OUT_EP_NUM | EP_OUTPUT,       /* bEndpointAddress */
#ifdef __FEEDBACK__
    0x05,                             /* bmAttributes */
#else
    0x09,                             /* bmAttributes */
#endif
    (EP3_MAX_PKT_SIZE & 0xff),
    ((EP3_MAX_PKT_SIZE >> 8) & 0xff), /* wMaxPacketSize */
    0x01,                             /* bInterval */
    0x00,                             /* bRefresh */
#ifdef __FEEDBACK__
    ISO_IN_FB_EP_NUM | EP_INPUT,      /* bSynchAddress */
#else
    0x00,                             /* bSynchAddress */
#endif

    /* Audio Streaming Class Specific Audio Data Endpoint Descriptor */
    0x07,                             /* bLength */
    0x25,                             /* bDescriptorType:CS_ENDPOINT */
    0x01,                             /* bDescriptorSubType:EP_GENERAL */
    0x01,                             /* bmAttributes */
    0x02,                             /* bLockDelayUnits */
    0x00, 0x00,                       /* wLockDelay */

#ifdef __FEEDBACK__
    /* Feedback Endpoint */
    0x09,                             /* bLength */
    0x05,                             /* bDescriptorType */
    ISO_IN_FB_EP_NUM | EP_INPUT,      /* bEndpointAddress */
    0x11,                             /* bmAttributes */
    EP4_MAX_PKT_SIZE, 0x00,           /* wMaxPacketSize */
    0x01,                             /* bInterval */
    0x09,                             /* bRefresh */
    0x00,                             /* bSynchAddress */
#endif
#ifdef __HID__
    /* Interface Descriptor for HID */
    LEN_INTERFACE,      /* bLength */
    DESC_INTERFACE,     /* bDescriptorType */
    0x03,               /* bInterfaceNumber */
    0x00,               /* bAlternateSetting */
    0x01,               /* bNumEndpoints : Interrupt IN Endpoint */
    0x03,               /* bInterfaceClass */
    0x00,               /* bInterfaceSubClass */
    0x00,               /* bInterfaceProtocol */
    0x00,               /* iInterface */

    /* HID Descriptor */
    LEN_HID,            /* Size of this descriptor in UINT8s */
    DESC_HID,           /* HID descriptor type. */
    0x10, 0x01,         /* HID Class Spec. release number.*/
    0x00,               /* H/W target country. */
    0x01,               /* Number of HID class descriptors to follow. */
    DESC_HID_RPT,       /* Dscriptor type. */

    /* Total length of report descriptor */
    sizeof(HID_DeviceReportDescriptor) & 0x00FF,
    ((sizeof(HID_DeviceReportDescriptor) & 0xFF00) >> 8),

    /* Endpoint Descriptor (Interrupt IN Endpoint) */
    LEN_ENDPOINT,                     /* bLength */
    DESC_ENDPOINT,                    /* bDescriptorType */
    (HID_IN_EP_NUM | EP_INPUT),       /* bEndpointAddress */
    EP_INT,                           /* bmAttributes */
    /* wMaxPacketSize */
    EP5_MAX_PKT_SIZE & 0x00FF,
    (EP5_MAX_PKT_SIZE & 0xFF00) >> 8,
    10,                               /* bInterval */
#endif
};

/*!<USB Language String Descriptor */
uint8_t gu8StringLang[4] =
{
    4,              /* bLength */
    DESC_STRING,    /* bDescriptorType */
    0x09, 0x04
};

/*!<USB Vendor String Descriptor */
uint8_t gu8VendorStringDesc[] =
{
    16,
    DESC_STRING,
    'N', 0, 'u', 0, 'v', 0, 'o', 0, 't', 0, 'o', 0, 'n', 0
};

/*!<USB Product String Descriptor */
uint8_t gu8ProductStringDesc[] =
{
#ifdef __HID__
    72,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '1', 0, '.', 0, '0', 0, ' ', 0,
    'H', 0, 'e', 0, 'a', 0, 'd', 0, 's', 0, 'e', 0, 't', 0,
    ' ', 0,
    'E', 0, 'a', 0, 'r', 0, 'p', 0, 'h', 0, 'o', 0, 'n', 0, 'e', 0,
    ' ', 0, '&', 0,
#ifdef __JOYSTICK__
    ' ', 0, 'J', 0, 'o', 0, 'y', 0, 's', 0, 't', 0, 'i', 0, 'c', 0, 'k', 0,
#elif defined __MEDIAKEY__
    ' ', 0, 'M', 0, 'e', 0, 'd', 0, 'i', 0, 'a', 0, 'k', 0, 'e', 0, 'y', 0,
#endif
#else
    50,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '1', 0, '.', 0, '0', 0, ' ', 0,
    'H', 0, 'e', 0, 'a', 0, 'd', 0, 's', 0, 'e', 0, 't', 0,
    ' ', 0,
    'E', 0, 'a', 0, 'r', 0, 'p', 0, 'h', 0, 'o', 0, 'n', 0, 'e', 0,
#endif
};

uint8_t *gpu8UsbString[4] =
{
    gu8StringLang,
    gu8VendorStringDesc,
    gu8ProductStringDesc,
    NULL,
};

uint8_t *gu8UsbHidReport[] =
{
    0,
    0,
    0,
#ifdef __HID__
    HID_DeviceReportDescriptor,
#else
    0
#endif
};

uint32_t gu32UsbHidReportLen[4] =
{
    0,
    0,
    0,
#ifdef __HID__
    sizeof(HID_DeviceReportDescriptor),
#else
    0
#endif
};

const uint32_t gu32ConfigHidDescIdx[4] =
{
    0,
    0,
    0,
#ifdef __HID__
#ifdef __FEEDBACK__
    232,
#else
    223,
#endif
#else
    0
#endif
};

const S_USBD_INFO_T gsInfo =
{
    (uint8_t *)gu8DeviceDescriptor,
    (uint8_t *)gu8ConfigDescriptor,
    (uint8_t **)gpu8UsbString,
    (uint8_t **)gu8UsbHidReport,
    NULL,
    (uint32_t *)gu32UsbHidReportLen,
    (uint32_t *)gu32ConfigHidDescIdx
};
